Revit 2027 API
PartUtils.GetPartMakerMethodToDivideVolumeFW Method
 Obtains the object allowing access to the divided volume properties of the PartMaker.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PartMakerMethodToDivideVolumes GetPartMakerMethodToDivideVolumeFW(
	PartMaker partMaker
)
Public Shared Function GetPartMakerMethodToDivideVolumeFW (
	partMaker As PartMaker
) As PartMakerMethodToDivideVolumes
public:
static PartMakerMethodToDivideVolumes^ GetPartMakerMethodToDivideVolumeFW(
	PartMaker^ partMaker
)
static member GetPartMakerMethodToDivideVolumeFW :
        partMaker : PartMaker -> PartMakerMethodToDivideVolumes
Parameters
partMaker PartMaker
 The PartMaker.
Return Value
PartMakerMethodToDivideVolumes
 The object handle. Returns null if the PartMaker does not represent divided volumes.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PartUtils Class
Autodesk.Revit.DB Namespace